app/controllers/posts_controller.rb

  def index
    @authors = Author.all
    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.from_today
      else
        @posts = Post.old_news
      end
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Testing"], ["description", "Let's try this out"], ["created_at", "2021-01-23 00:17:16.475194"], ["updated_at", "2021-01-23 00:17:16.475194"]]